hiperiondev/esp32idf_APRS/components/message/message.c
// @file message.c
//
// @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
// @date 2026
// @copyright GNU General Public License v3
// @see https://github.com/hiperiondev/esp32idf_APRS
//
// @note
// This is based on other projects:
//     VP-Digi: https://github.com/sq8vps/vp-digi
//     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
//     LibAPRS: https://github.com/markqvist/LibAPRS
//
//     please contact their authors for more information.
//
// @brief APRS text messaging implementation: outgoing message and ACK
// formatting, incoming message parsing and acknowledgement, the Reply-ACK
// algorithm of APRS 1.1, and retry/timeout handling of the in-memory queue.

#include <ctype.h>
#include <stdio.h>
#include <string.h>
#include <time.h>

#include "driver/gpio.h"
#include "esp_log.h"
#include "esp_timer.h"

#include "afsk.h" // afsk_ptt_gpio_is_valid(), MODEM_ADC_GPIO / MODEM_DAC_GPIO (checked internally by afsk_ptt_gpio_is_valid())
#include "app_config.h"
#include "aprs_path.h"                          // aprs_path_build_suffix_from_config(), APRS_PATH_TCPIP_SUFFIX
#include "aprs_service.h"                       // APRS_TOCALL: this station's destination call, same one every other packet type uses
#include "esp32idf_radioamateur_modem_config.h" // MODEM_PTT_GPIO: the fixed PTT pin, checked directly below
#include "gps.h"                                // gps_gpio_is_reserved(): keep the GNSS serial pins out of the alarm pin
#include "json_escape.h"                        // json_escape()
#include "message.h"
#include "query.h"             // query_process_directed(): second consumer of the ::ADDRESSEE: payload, for "CALL:?query?"
#include "sensors_local_i2c.h" // sensors_local_i2c_gpio_is_reserved(): keep the I2C pins out of the alarm pin
#include "str_append.h"

static const char *TAG = "message";

#define MSG_ALARM_PULSE_MS 1000

static msg_entry_t s_queue[MSG_QUEUE_SIZE];

// Pieces of one serialized queue entry that are not one of the two escaped text
// fields, used to check MSG_JSON_ENTRY_MAX against the field widths of
// msg_entry_t. Both escaped fields are bounded by their own destination buffer
// in message_next_json(), which json_escape() never overruns, so those two
// widths doubled plus these three numbers bound the whole object.
#define MSG_JSON_TEMPLATE_LEN 50 // punctuation and key names of the object template
#define MSG_JSON_TIME_LEN     20 // widest "time" value: int64 seconds, sign included
#define MSG_JSON_STATUS_LEN   7  // longest "dir"/"status" word ("pending")

_Static_assert(MSG_JSON_ENTRY_MAX >= MSG_JSON_TEMPLATE_LEN + MSG_JSON_TIME_LEN + 2 * MSG_JSON_STATUS_LEN + (sizeof(((msg_entry_t *)0)->callsign) * 2 - 1) +
                                         (MSG_TEXT_MAX * 2 - 1) + 1,
               "MSG_JSON_ENTRY_MAX is too small for the message field widths");
static uint32_t s_seq = 0;
static uint16_t s_msgID = 0;
static void (*s_txHandler)(const char *packet, size_t len, uint8_t channels) = NULL;

// ---------------------------------------------------------------------------
// Reply-ACK (APRS 1.1): the acknowledgement owed to each correspondent
//
// The number of the last message received from a station is remembered here
// and rides out as the "}AA" free acknowledgement on the next message sent to
// that station, which is what saves the round trip a separate "ackNN" would
// need. It stays owed until that station sends a newer numbered message: the
// algorithm asks for the latest outstanding acknowledgement on every
// transmission, retries included, and repeating it costs two characters while
// giving the acknowledgement another chance to arrive.
// ---------------------------------------------------------------------------
typedef struct {
    char callsign[11]; // correspondent, upper case (empty slot when NUL at [0])
    char mm[3];        // that station's latest message number, as received
    uint32_t seq;      // update order, for reuse of the least recently written slot
} reply_ack_t;

static reply_ack_t s_replyAck[MSG_REPLY_ACK_STATIONS];
static uint32_t s_replyAckSeq = 0;

void message_set_tx_handler(void (*handler)(const char *packet, size_t len, uint8_t channels)) {
    s_txHandler = handler;
}

void message_init(void) {
    memset(s_queue, 0, sizeof(s_queue));
    s_seq = 0;
    memset(s_replyAck, 0, sizeof(s_replyAck));
    s_replyAckSeq = 0;
}

// ---------------------------------------------------------------------------
// Message Alarm GPIO: driven to 1 for MSG_ALARM_PULSE_MS whenever a direct
// message addressed to g_config.msg_mycall is received, then back to 0 until
// the next one. Disabled by default (g_config.msg_alarm_enable == false /
// g_config.msg_alarm_gpio == -1).
// ---------------------------------------------------------------------------
static int8_t s_alarmGpio = -1;
static esp_timer_handle_t s_alarmTimer = NULL;

bool message_alarm_gpio_is_valid(int8_t gpio) {
    if (gpio == -1)
        return true; // "disabled" is always accepted

    // Output-capable, not the input-only pads, not the internal flash/PSRAM
    // pads, and not colliding with the audio modem's ADC/DAC - same rules
    // as the PTT pin (see afsk_ptt_gpio_is_valid()).
    if (!afsk_ptt_gpio_is_valid(gpio))
        return false;

    // Reject a GPIO already used by the PTT pin, a fixed compile-time
    // constant (MODEM_PTT_GPIO).
    if (gpio == MODEM_PTT_GPIO)
        return false;

    // Not already used by any sensors_local peripheral bus. (These fields are
    // config-struct-only placeholders with no driver behind them yet - see
    // the same note in web_gpio_collect_used() - so they're not checked here;
    // only pins that are genuinely wired to something (PTT above, the shared
    // sensor I2C bus via sensors_local_i2c_gpio_is_reserved()) can make a GPIO
    // invalid.)
    if (sensors_local_i2c_gpio_is_reserved(gpio))
        return false;

    // Not already used by the GNSS receiver's serial port. Both of its pins
    // count: the transmit pin is wired to the module's input on this board
    // even though nothing is ever sent on it.
    if (gps_gpio_is_reserved(gpio))
        return false;

