hiperiondev/esp32idf_APRS/components/message/message.c
    return true;
}

static void alarmTimerCb(void *arg) {
    (void)arg;
    if (s_alarmGpio >= 0)
        gpio_set_level((gpio_num_t)s_alarmGpio, 0);
}

void message_alarm_configure(bool enable, int8_t gpio) {
    int8_t new_gpio = (enable && message_alarm_gpio_is_valid(gpio)) ? gpio : -1;

    if (s_alarmTimer)
        esp_timer_stop(s_alarmTimer); // no-op if not running

    // Release the previous pin (disabling, or switching to a different one)
    // so a stale output isn't left driving.
    if (s_alarmGpio >= 0 && s_alarmGpio != new_gpio) {
        gpio_set_level((gpio_num_t)s_alarmGpio, 0);
        gpio_set_direction((gpio_num_t)s_alarmGpio, GPIO_MODE_INPUT);
    }

    s_alarmGpio = new_gpio;

    if (s_alarmGpio < 0)
        return;

    if (!s_alarmTimer) {
        const esp_timer_create_args_t args = {
            .callback = alarmTimerCb,
            .name = "msg_alarm",
        };
        if (esp_timer_create(&args, &s_alarmTimer) != ESP_OK) {
            ESP_LOGW(TAG, "Message Alarm: failed to create timer, disabling");
            s_alarmGpio = -1;
            return;
        }
    }

    gpio_reset_pin((gpio_num_t)s_alarmGpio);
    gpio_set_direction((gpio_num_t)s_alarmGpio, GPIO_MODE_OUTPUT);
    gpio_set_level((gpio_num_t)s_alarmGpio, 0); // idle low until a message arrives
    ESP_LOGI(TAG, "Message Alarm: GPIO%d enabled", (int)s_alarmGpio);
}

// Pulses the alarm pin high for MSG_ALARM_PULSE_MS. Called each time a direct
// message for g_config.msg_mycall is received. Re-arms the timer on every
// call, so back-to-back messages keep the pin high without flickering, and it
// only drops back to 0 once MSG_ALARM_PULSE_MS elapses with no new message.
static void message_alarm_pulse(void) {
    if (s_alarmGpio < 0 || !s_alarmTimer)
        return;

    gpio_set_level((gpio_num_t)s_alarmGpio, 1);
    esp_timer_stop(s_alarmTimer); // no-op if not currently running
    esp_timer_start_once(s_alarmTimer, (uint64_t)MSG_ALARM_PULSE_MS * 1000ULL);
}

// ---------------------------------------------------------------------------
// Helpers: trim, uppercase
// ---------------------------------------------------------------------------
static void trimUpper(char *s) {
    // trim
    char *start = s;
    while (*start && isspace((unsigned char)*start))
        start++;
    if (start != s)
        memmove(s, start, strlen(start) + 1);
    size_t len = strlen(s);
    while (len > 0 && isspace((unsigned char)s[len - 1]))
        s[--len] = 0;
    for (size_t i = 0; i < len; i++)
        s[i] = toupper((unsigned char)s[i]);
}

// Compares two callsigns ignoring any "-SSID" suffix, so a message sent to
// "N0CALL", "N0CALL-0".."N0CALL-15" (or any other/garbled SSID) is treated
// as addressed to station "N0CALL". Case-insensitive; SSID digits themselves
// are not validated, only stripped.
static bool callsignBaseMatch(const char *a, const char *b) {
    size_t na = 0, nb = 0;
    while (a[na] && a[na] != '-')
        na++;
    while (b[nb] && b[nb] != '-')
        nb++;
    if (na == 0 || na != nb)
        return false;
    return strncasecmp(a, b, na) == 0;
}

// Reports whether toCall (already trimmed and upper-cased) is one of the
// message-group addressees this station reads: the built-in "ALL"/"QST"/"CQ"
// set every station reads per APRS101 chapter 14, or one of the operator's
// own group names in g_config.msg_group[]. Compared whole, unlike a callsign:
// a group name carries no SSID and is matched exactly.
static bool isGroupAddressee(const char *toCall) {
    if (strcmp(toCall, "ALL") == 0 || strcmp(toCall, "QST") == 0 || strcmp(toCall, "CQ") == 0)
        return true;

    for (int i = 0; i < MSG_USER_GROUPS; i++) {
        if (g_config.msg_group[i][0] == 0)
            continue;
        char group[10];
        strncpy(group, g_config.msg_group[i], sizeof(group) - 1);
        group[sizeof(group) - 1] = 0;
        trimUpper(group);
        if (group[0] && strcmp(toCall, group) == 0)
            return true;
    }
    return false;
}

// ---------------------------------------------------------------------------
// Reply-ACK: reading a received identifier and building an outgoing one
// ---------------------------------------------------------------------------

// Reads a message number written as plain decimal digits. Anything else - an
// empty field, an alphanumeric identifier another client may have issued, a
// value past the width of the field - is refused, because the only numbers
// matched against the outbound queue are the ones this station issued itself.
static bool parseMsgNumber(const char *s, uint16_t *out) {
    if (s == NULL || s[0] == 0)
        return false;

    unsigned long v = 0;
    for (size_t i = 0; s[i]; i++) {
        if (i >= 5 || s[i] < '0' || s[i] > '9')
            return false;
        v = v * 10 + (unsigned long)(s[i] - '0');
    }
    if (v > UINT16_MAX)
        return false;

    *out = (uint16_t)v;
    return true;
}

// Checks whether s is a valid message-number field as APRS101 chapter 14
// defines it for an "ack"/"rej": 1-5 alphanumeric characters, optionally
// followed by a single '}' and up to two more characters (the Reply-ACK free
// acknowledgement), with nothing else before the end of the string. Ordinary
// message text that merely happens to start with "ack"/"rej" - "acknowledged,
// thanks", "rejoining net" - fails this check and is left as plain text.
static bool isValidMsgNoField(const char *s) {
    if (s == NULL || s[0] == 0)
        return false;

    size_t i = 0;
    while (i < 5 && isalnum((unsigned char)s[i]))
        i++;
    if (i == 0)
        return false;

    if (s[i] == 0)
        return true; // plain "MM", 1-5 alphanumeric characters, nothing else

    if (s[i] != '}')
        return false; // more than 5 characters before any '}', or other junk

    return strlen(s + i + 1) <= 2; // "MM}" or "MM}AA"
}

// Splits a received message identifier into the sender's own number and the
// free acknowledgement it carries: "MM}AA" gives both, "MM}" gives the number
// and an empty acknowledgement, and a plain "MM" gives the number alone. Both
// outputs are always NUL-terminated.
static void splitReplyAck(const char *msgNo, char *own, size_t own_size, char *ack, size_t ack_size) {
    if (own_size == 0 || ack_size == 0)
        return;

    own[0] = 0;
    ack[0] = 0;

    const char *sep = strchr(msgNo, '}');
    size_t n = sep ? (size_t)(sep - msgNo) : strlen(msgNo);
    if (n > own_size - 1)
        n = own_size - 1;
    memcpy(own, msgNo, n);
    own[n] = 0;

