hiperiondev/esp32idf_APRS/components/message/message.c
    if (sep) {
        strncpy(ack, sep + 1, ack_size - 1);
        ack[ack_size - 1] = 0;
    }
}

// Records the acknowledgement now owed to a station. A station already in the
// table keeps its slot and has its number replaced, so only the latest one is
// ever owed; a new station takes a free slot, or the one written longest ago.
static void replyAckRemember(const char *call, const char *mm) {
    if (call[0] == 0 || mm[0] == 0)
        return;

    int slot = -1;
    uint32_t oldest = 0;
    for (int i = 0; i < MSG_REPLY_ACK_STATIONS; i++) {
        if (strcmp(s_replyAck[i].callsign, call) == 0) {
            slot = i;
            break;
        }
        if (s_replyAck[i].callsign[0] == 0) {
            slot = i;
            break;
        }
        if (slot < 0 || s_replyAck[i].seq < oldest) {
            oldest = s_replyAck[i].seq;
            slot = i;
        }
    }

    memset(s_replyAck[slot].callsign, 0, sizeof(s_replyAck[slot].callsign));
    strncpy(s_replyAck[slot].callsign, call, sizeof(s_replyAck[slot].callsign) - 1);
    memset(s_replyAck[slot].mm, 0, sizeof(s_replyAck[slot].mm));
    strncpy(s_replyAck[slot].mm, mm, sizeof(s_replyAck[slot].mm) - 1);
    s_replyAck[slot].seq = ++s_replyAckSeq;
}

// Builds the message-number suffix of an outgoing message: "{MM}" on its own,
// or "{MM}AA" when this station owes that correspondent an acknowledgement.
// Called at the moment a frame is built rather than when the message is queued,
// so a retry carries whatever is owed by then and not what was owed when the
// operator wrote the message. The trailing brace is present either way: it is
// what tells the other end that a Reply-ACK can be sent back.
//
// Callsigns are matched exactly, the same rule pkgMsg_Find() applies to an
// incoming ack, so an acknowledgement owed to one SSID of a station is never
// attached to a message addressed to another.
static void buildMsgNumberSuffix(const char *call, uint16_t msgID, char *out, size_t out_size) {
    const char *owed = "";
    for (int i = 0; i < MSG_REPLY_ACK_STATIONS; i++) {
        if (s_replyAck[i].callsign[0] && strcmp(s_replyAck[i].callsign, call) == 0) {
            owed = s_replyAck[i].mm;
            break;
        }
    }
    snprintf(out, out_size, "{%02u}%s", (unsigned)msgID, owed);
}

// ---------------------------------------------------------------------------
// Queue management
// ---------------------------------------------------------------------------
int pkgMsg_Find(const char *call, uint16_t msgID, bool rxtx) {
    // Exact match only. s_queue[i].callsign is always NUL-terminated (see
    // pkgMsgStore(), which memset()s the field before strncpy()) and always
    // upper case, as is every callsign reaching this function, so a plain
    // strcmp() is safe here. A substring search would be wrong: a stored
    // "N0CALL" would match an incoming "N0CALL-9" and vice versa, and two
    // unrelated callsigns could coincidentally overlap, letting an ack/reply
    // from the wrong station mark another station's queued message as
    // acknowledged.
    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        if (s_queue[i].used && s_queue[i].msgID == msgID && s_queue[i].rxtx == rxtx && strcmp(s_queue[i].callsign, call) == 0)
            return i;
    }
    return -1;
}

// Picks the slot the next message goes into: a free one while the queue is
// filling up, otherwise the slot holding the oldest message of the whole
// conversation, received or outbound. Age is taken from the insertion counter
// rather than from the wall clock, so the choice stays right while the system
// clock is still unset and when NTP steps it.
static int pkgMsgEvictSlot(void) {
    int ret = 0;
    uint32_t oldest = 0;
    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        if (!s_queue[i].used)
            return i;
        if (i == 0 || s_queue[i].seq < oldest) {
            oldest = s_queue[i].seq;
            ret = i;
        }
    }
    return ret;
}

// Appends one message to the conversation. Every call takes a slot of its own,
// so a received message sits in the history next to the ones this station sent
// and stays there until MSG_QUEUE_SIZE newer messages have pushed it out. group
// is meaningful for RX entries only: true when the message was addressed to a
// message group rather than to this station's own callsign, which is what
// keeps a group message and a direct message that happen to share the same
// sender and message number in separate slots.
static int pkgMsgStore(const char *call, const char *text, uint16_t msgID, int8_t ack, bool rxtx, bool group) {
    if (!call[0] || !text[0])
        return -1;

    int i = pkgMsgEvictSlot();

    s_queue[i].used = true;
    s_queue[i].seq = ++s_seq;
    s_queue[i].time = time(NULL);
    s_queue[i].last_tx = s_queue[i].time;
    s_queue[i].msgID = msgID;
    s_queue[i].ack = ack;
    s_queue[i].rxtx = rxtx;
    s_queue[i].group = group;
    memset(s_queue[i].callsign, 0, sizeof(s_queue[i].callsign));
    strncpy(s_queue[i].callsign, call, sizeof(s_queue[i].callsign) - 1);
    memset(s_queue[i].text, 0, sizeof(s_queue[i].text));
    strncpy(s_queue[i].text, text, sizeof(s_queue[i].text) - 1);
    return i;
}

// Tells a retransmission from a new message. A sender that gets no ack sends
// the very same message again - same station, same APRS message number, same
// text - and that repeat belongs in the history once, not once per copy heard.
// Anything else is a new line of the conversation, including a second message
// carrying the number the sender used before (numbering restarts when the
// sending station reboots), a message with no number at all, which arrives
// with number 0 the way every other unnumbered message does, and a group
// message that happens to share its sender and number with an unrelated
// direct message, which is a different line of the conversation and is kept
// in a slot of its own. Text is compared as stored, i.e. after the truncation
// to MSG_TEXT_MAX bytes.
static int pkgMsgFindRepeat(const char *call, const char *text, uint16_t msgID, bool rxtx, bool group) {
    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        if (!s_queue[i].used || s_queue[i].rxtx != rxtx || s_queue[i].msgID != msgID || s_queue[i].group != group)
            continue;
        if (strcmp(s_queue[i].callsign, call) != 0)
            continue;
        if (strncmp(s_queue[i].text, text, sizeof(s_queue[i].text) - 1) == 0)
            return i;
    }
    return -1;
}

