hiperiondev/esp32idf_APRS/components/message/message.c
    char toCallFixed[10];
    memset(toCallFixed, ' ', 9);
    toCallFixed[9] = 0;
    memcpy(toCallFixed, toCallUp, strlen(toCallUp) > 9 ? 9 : strlen(toCallUp));

    // Enforced here rather than trusted to the caller, so the on-air text
    // length and character set stay correct regardless of where the call
    // came from: truncated to the standard APRS message text length and
    // stripped of the characters APRS101 reserves for telemetry and the
    // message-number delimiter.
    char payload[APRS_MSG_TEXT_STD_MAX + 1];
    sanitizeOutgoingText(text, payload, sizeof(payload));

    char suffix[8];
    buildMsgNumberSuffix(toCallUp, s_msgID, suffix, sizeof(suffix));

    char info[320];
    snprintf(info, sizeof(info), ":%s:%s%s", toCallFixed, payload, suffix);

    txPacket(myCallUp, info);
    ESP_LOGD(TAG, "Send APRS message to %s msgID %u: %s", toCall, (unsigned)s_msgID, info);

    int8_t ackVal = (g_config.msg_retry == 0) ? -2 : (int8_t)g_config.msg_retry;
    // The trimmed upper-case addressee is what goes in the queue, matching the
    // form the callsign takes on the air. An incoming ack is matched against
    // this field by exact comparison, and it is also the name the chat page
    // shows next to the message. The sanitized payload is stored rather than
    // the caller's raw text, so a retry re-sends exactly what was already put
    // on the air instead of re-deriving it.
    pkgMsgStore(toCallUp, payload, s_msgID, ackVal, false, false);
}

void sendAPRSAck(const char *toCall, const char *msgNo) {
    char toCallFixed[10];
    memset(toCallFixed, ' ', 9);
    toCallFixed[9] = 0;
    size_t n = strlen(toCall);
    memcpy(toCallFixed, toCall, n > 9 ? 9 : n);

    char myCall[10];
    app_config_lock();
    memcpy(myCall, g_config.msg_mycall, sizeof(myCall));
    app_config_unlock();
    // The copy above takes the full field width, so termination depends on
    // what the config loader stored. Force it: everything downstream treats
    // this as a C string, and a field filled edge to edge would send it
    // reading past the end of the local buffer.
    myCall[sizeof(myCall) - 1] = 0;

    char info[160];
    snprintf(info, sizeof(info), ":%s:ack%s", toCallFixed, msgNo);
    txPacket(myCall, info);
    ESP_LOGD(TAG, "Send APRS ACK to %s msgNo %s", toCall, msgNo);
}

int message_send_pending_to(const char *toCall) {
    if (toCall == NULL || toCall[0] == 0)
        return 0;

    char myCall[10];
    app_config_lock();
    memcpy(myCall, g_config.msg_mycall, sizeof(myCall));
    app_config_unlock();
    // The copy above takes the full field width, so termination depends on
    // what the config loader stored. Force it: everything downstream treats
    // this as a C string, and a field filled edge to edge would send it
    // reading past the end of the local buffer.
    myCall[sizeof(myCall) - 1] = 0;

    int sent = 0;
    int held = 0;
    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        // ack > 0 is the "outbound and still waiting for an ack" state; an
        // acked (-2), rejected (-3) or received (-1) entry is not something
        // this station is holding for the querying operator.
        if (!s_queue[i].used || s_queue[i].rxtx || s_queue[i].ack <= 0)
            continue;
        if (!callsignBaseMatch(s_queue[i].callsign, toCall))
            continue;

        // One query answers with a handful of frames, not with the whole
        // queue: MSG_QUERY_BURST_MAX bounds how long the transmitter can stay
        // keyed on behalf of a single question. The rest of the loop only
        // counts what is left over - those slots keep their retry state, so
        // sendAPRSMessageRetry() carries them at the configured interval,
        // which is the paced path this traffic already has.
        if (sent >= MSG_QUERY_BURST_MAX) {
            held++;
            continue;
        }

        // The retry counter and timestamp are deliberately left alone: this
        // transmission answers a query, so it must not spend one of the
        // message's own delivery attempts nor push the next scheduled retry
        // out by one interval.
        char toCallFixed[10];
        memset(toCallFixed, ' ', 9);
        toCallFixed[9] = 0;
        size_t n = strlen(s_queue[i].callsign);
        memcpy(toCallFixed, s_queue[i].callsign, n > 9 ? 9 : n);

        char payload[300];
        strncpy(payload, s_queue[i].text, sizeof(payload) - 1);
        payload[sizeof(payload) - 1] = 0;

        char suffix[8];
        buildMsgNumberSuffix(s_queue[i].callsign, s_queue[i].msgID, suffix, sizeof(suffix));

        char info[320];
        snprintf(info, sizeof(info), ":%s:%s%s", toCallFixed, payload, suffix);
        txPacket(myCall, info);
        sent++;
    }

    if (sent > 0) {
        if (held > 0)
            ESP_LOGI(TAG, "?APRSM from %s answered with %d pending message(s), %d left to the retry timer", toCall, sent, held);
        else
            ESP_LOGI(TAG, "?APRSM from %s answered with %d pending message(s)", toCall, sent);
    }
    return sent;
}

void sendAPRSMessageRetry(void) {
    time_t now = time(NULL);

    // Snapshot the own-call once, so a web save can't rewrite it mid-loop
    // while frames are being built.
    char myCall[10];
    app_config_lock();
    memcpy(myCall, g_config.msg_mycall, sizeof(myCall));
    app_config_unlock();
    // The copy above takes the full field width, so termination depends on
    // what the config loader stored. Force it: everything downstream treats
    // this as a C string, and a field filled edge to edge would send it
    // reading past the end of the local buffer.
    myCall[sizeof(myCall) - 1] = 0;

    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        if (!s_queue[i].used || s_queue[i].ack <= 0)
            continue;
        if ((now - s_queue[i].last_tx) <= g_config.msg_interval)
            continue;

        // Stamp the moment this retry is sent. The guard above compares
        // (now - last_tx) against msg_interval, so the timestamp must be the
        // instant of the last transmission for the next attempt to fall
        // exactly one msg_interval later. It is a separate field from the
        // creation time the chat page displays, which stays put: a message is
        // dated when it was written, not when it was last put on the air.
        if (--s_queue[i].ack > 0)
            s_queue[i].last_tx = now;

