hiperiondev/esp32idf_APRS/components/message/message.c
    // Accept the message either addressed to this station - the addressee's
    // base callsign matches ours regardless of SSID on either side, so a
    // message to "N0CALL", "N0CALL-7", etc. is accepted as long as the
    // configured mycall is "N0CALL", with or without its own SSID - or
    // addressed to a message group this station reads (APRS101 chapter 14):
    // the built-in "ALL"/"QST"/"CQ" set, or one of g_config.msg_group[].
    // isDirect is what the rest of this function routes every "acknowledge
    // it" / "remember a Reply-ACK for it" / "pulse the alarm for it" decision
    // on, never on acceptance alone: a group has no single owner to send an
    // ack back, and every member reading it would otherwise answer at once.
    bool isDirect = callsignBaseMatch(toCall, g_config.msg_mycall);
    bool isGroup = !isDirect && isGroupAddressee(toCall);
    if (!isDirect && !isGroup)
        return;

    // An ack or rej always carries a message ID (it's the ID of the queued
    // message being acknowledged/rejected); without one there is nothing to
    // match against a queued outgoing message, so it can't be processed. A
    // group address can't carry one either: an ack/rej is a reply to this
    // station's own outbound message, which is only ever sent to a callsign,
    // never to a group.
    if ((isAck || isRej) && (msgNo[0] == 0 || isGroup))
        return;

    uint16_t number;

    if (isAck) {
        int i = parseMsgNumber(ownNo, &number) ? pkgMsg_Find(fromCall, number, false) : -1;
        if (i >= 0)
            s_queue[i].ack = -2; // acked
        return;
    }

    if (isRej) {
        int i = parseMsgNumber(ownNo, &number) ? pkgMsg_Find(fromCall, number, false) : -1;
        if (i >= 0)
            s_queue[i].ack = -3; // rejected by recipient: stop retrying, don't count as delivered
        return;
    }

    char decoded[300];
    strncpy(decoded, message, sizeof(decoded) - 1);
    decoded[sizeof(decoded) - 1] = 0;

    size_t dlen = strlen(decoded);
    while (dlen > 0 && isspace((unsigned char)decoded[dlen - 1]))
        decoded[--dlen] = 0;
    if (dlen == 0)
        return;

    // A free acknowledgement riding with the message clears the outbound
    // message it names, so a reply doubles as the ack for what it replies to
    // and no separate "ackNN" has to survive the return path. Meaningless for
    // a group message - this station never sent an outbound message to a
    // group for one to acknowledge - so skipped entirely for one.
    if (!isGroup && parseMsgNumber(replyAck, &number)) {
        int i = pkgMsg_Find(fromCall, number, false);
        if (i >= 0)
            s_queue[i].ack = -2;
    }

    // Every received message is a new line of the conversation and gets a queue
    // slot of its own; only a copy of one already in the history is left out,
    // and even then the ack below still goes back out for a direct message,
    // since a repeat means the sender never heard the first one. The message
    // is identified by the sender's own number and its direct/group status, so
    // two copies carrying different free acknowledgements are still one
    // message, while a group message and a direct message that happen to
    // share a sender and number are two.
    uint16_t rxID = 0;
    parseMsgNumber(ownNo, &rxID);
    if (pkgMsgFindRepeat(fromCall, decoded, rxID, true, isGroup) < 0)
        pkgMsgStore(fromCall, decoded, rxID, -1, true, isGroup);

    // A group message is never acked, never retransmitted and never
    // auto-replied to, "{id" suffix or not - it has no single owner to answer
    // it, and answering on behalf of the whole group would key the
    // transmitter for every member that heard it. Per APRS101 the message ID
    // is otherwise optional: for a direct message, only send an ack when the
    // sender actually requested one. That ack quotes the identifier whole,
    // Reply-ACK suffix included, and the sender's own number becomes the
    // acknowledgement owed back to that station.
    if (!isGroup) {
        if (msgNo[0] != 0) {
            sendAPRSAck(fromCall, msgNo);
            replyAckRemember(fromCall, ownNo);
        }
        message_alarm_pulse();
    }
}
